//////////////////////////////////////////////////////////////////////////////////	 
//
//  文 件 名   : 2017电子设计大赛A题——微电网模拟系统
//  版 本 号   : v2.0
//  作    者   : 梁全乐
//  生成日期   : 2017-08-11
//  最近修改   : 
//  功能描述   : 四路AD采样-三路互补SPWM输出-6_pin-OLED显示
//							 三项逆变需要6路spwm并且22互补，但是我们采用的驱动器是2104，芯片自动互补所以只需要3路即可
//							 PID的调节放在定时器中断中
//							 对于按键的功能是想要实现2逆变器之间对负载的输出功率可调
//								
//
//              四路AD采样：
//              ----------------------------------------------------------------
//              ADC1 通道0：PA0——电压采样
//              ADC1 通道1：PA1——电流采样
//              ADC1 通道2：PA2
//              ADC1 通道3：PA3            
//              ----------------------------------------------------------------
//
//              SPMW 3路输出
//							----------------------------------------------------------------    
//              通道2：PA7
//              通道3：PB0
//              通道4：PB1
//             ----------------------------------------------------------------
//
//              OLED接线说明: 
//              ----------------------------------------------------------------
//              GND  电源地
//              VCC  接5V或3.3v电源
//              SCL  接PA4（D0）
//              SDA  接PA5（D1）
//              RES  接PA6
//              DC   接PA8
//              ----------------------------------------------------------------
//******************************************************************************/
#include "stm32f10x.h"
#include "SPWM.h"
#include "oled.h"
#include "delay.h"
#include "adc.h"
#include "key.h"
#include "usart.h"
#include "PID.h"

vu16 freq = 18000, Period=0;	//PWM与定时器中断频率；自动重装载值


 int main(void)
 {	
  u16 adc0,adc1,adc2,adc3;
	
	Period_percent=1;               //调制比
	 
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2); 
	TIM3_PWM_Init(4000,0);	 //输出PWM的频率为18KHz(一周期360个点，正弦波的频率为18000/360=50Hz)
	TIM2_Int_Init(9999,7199);//PID调节
	TIM2_Cap_Init(9999,7199);//输入捕获
	delay_init();	        
	Adc_Init();
	uart_init(115200);
	OLED_Init();
	OLED_Clear1();
	PID_Parameter_Init(&voltage,0.970,0.05,0.05,0);
	 /*********************显示提示信息************************/
	 OLED_ShowString1(0,0,"Vout:");
	 OLED_ShowString1(0,2,"I");
	 
	 while(1)
	 {	
		//均值滤波 	adc0为输出电压，adc1为输出电流	 
		adc0=Get_Adc_Average(ADC_Channel_0,10); 
		adc1=Get_Adc_Average(ADC_Channel_1,10);
	
		//通过计算得到电压电流
		temp0=(float)adc0*(3.3/4095);
		temp1=(float)adc1*(3.3/4095);
				 
		printf("Vout:%f   Iout:%f   MOD:%f\n",temp0,temp1,Period_percent); 	
	 }

 }
